[
  {
    "id": 1,
    "imgUrl": "https://imprimo.co.in/products/MP_305P_SP.jpg",
    "description": "The MP 305 SP is smart, compact A4 monochrome MFPs with A3 capability that is ideal for small to medium-sized offices. With great usability functions like the Smart Operation Panel, you get all the advantages and the compact footprint of an A4 MFP but with A3 printing capabilities. Printing at 30ppm this device is versatile, extremely quiet and ideal if you’re looking for inexpensive A3 printing solutions without losing valuable office space that a traditional A3 MFP would occupy."
  },
  {
    "id": 2,
    "imgUrl": "https://imprimo.co.in/products/MP_2014_D.jpg",
    "description": "The Ricoh MP 2014/ MP 2014D/ MP 2014AD is an A3 black-and-white MFP with a brisk output speed of 20 ppm, providing maximum efficiency for document processing in your office. Your total cost of ownership is low because the MP 2014/ MP 2014D/ MP 2014AD has an economical initial cost with low operating expenses. This reliable MFP has been designed to provide you with robust performance in demanding office environments. The comes with an Energy Saving Key, putting it instantly into sleep-mode, reducing your energy bill."
  },
  {
    "id": 3,
    "imgUrl": "https://imprimo.co.in/products/MP_3055_SP.png",
    "description": "Use the RICOH® MP 3055SP to simplify everyday office tasks and move information to the people who need it most, in the format they prefer. Scan full-color images, brochures and other documents and distribute them instantly. With the same pinch-and-flick and scrolling gestures you use on your smartphone or tablet, you can access critical information, set shortcuts and distribute information from the advanced 25.65 cm Smart Operation Panel. Alternatively, you can use smart mobile devices to connect remotely and work"
  },
  {
    "id": 4,
    "imgUrl": "https://imprimo.co.in/products/MP_C3004exSP.jpg",
    "description": "As speed is one important key success factor of your business, Ricoh launches Ricoh EZ Plus –Starter Pack, it can help to simplify and speed up your documents processes. These four applications installed on Ricoh multifunction printer’s Smart Operation Panel, aim to eliminate the tedious steps for some of the existing documents processes. Thus, allowing you to work more efficiently and focus on your primary job."
  },
  {
    "id": 5,
    "imgUrl": "https://imprimo.co.in/products/DD_5450.jpg",
    "description": "The DD 5450 A3 digital duplicator is a robust mid-range model offering excellent performance at an affordable cost. Running at a fast print speed of up to 130 cpm, and offering high-quality image duplication, the DD 5450 is equipped with a user-friendly operation panel, an integrated network controller, @Remote capabilities, and innovative features to ensure smooth paper transfer. It is particularly suitable for educational institutions, government offices and NGOs."
  },
  {
    "id": 6,
    "imgUrl": "https://imprimo.co.in/products/SP_C252_DN.jpg",
    "description": "RICOH SP C252DN offers all the benefits of colour with no-compromise performance. Productive and economical, they are designed for professionals and busy workgroups, combining quality colour, reliability and low running costs. With fast print speeds, double-sided printing and wireless networking, RICOH SP C252DN is an excellent print solution. It supports wireless printing and scanning from smartphones and tablet computers."
  },
  {
    "id": 7,
    "imgUrl": "https://imprimo.co.in/products/SP_212_NW.jpg",
    "description": "The RICOH SP 212Nw combines high productivity with ease of use in a compact package. Compact enough to fit on a desktop, and so quiet that it goes unnoticed, the single function series RICOH SP 212Nw is the ideal A4 black & white printer for small and home offices. A fast print speed. To top it off, paperless fax reception, manual double-sided printing and a high-yield, all-in-one print cartridge reduce your overall costs. Space saving Fast: 22 pages per minute High resolution: Max 1200 dpi Manual double-sided printing & PCL support"
  },
  {
    "id": 8,
    "imgUrl": "https://imprimo.co.in/products/SP_3510_SF.jpg",
    "description": "The Aficio™SP 3500SF/SP 3510SF black-and-white A4 MFPs give you smart new ways to print, copy, scan and fax. They significantly reduce your costs and improve the speed and agility of your business. These devices are packed with all the features you would expect from a top-of-the-range MFP in terms of speed, image quality and paper handling options. Plus, they are compact and easy-to-maintain."
  },
  {
    "id": 9,
    "imgUrl": "https://imprimo.co.in/products/D5500.jpg",
    "description": "Ricoh brings yet another revolutionary product to the business, industrial and educational worlds: the Interactive Whiteboard D5500. It offers high-quality, smooth handwriting and a high-resolution display, and enables easy remote image sharing. This remarkable innovation will make your business meetings, teleconferences, collaborative presentations and classroom training sessions so much more productive and cost-efficient."
  },
  {
    "id": 10,
    "imgUrl": "https://imprimo.co.in/products/PJWU_6181N.jpg",
    "description": "With an output of 483W this powerful WUXGA projector gives you a display resolution of 1920x1200 pixels to support HD quality presentations in 16:10 screen aspect ratio for up to 100 people. Viewing comfort is assured with a 6000:1 contrast ratio and 6200 lumens brilliance providing vivid presentations with vibrant colours. The PJ WU6181N is simple for you to operate with a remote control and it can even be remotely managed from another location via a LAN connection"
  }
]
